GopalSaraf/Practicals/PSDL/include/proc/pic18f25q43.h
extern volatile CCP2PPSbits_t CCP2PPSbits __at(0x250);
// bitfield macros
#define _CCP2PPS_PIN_POSN                                   0x0
#define _CCP2PPS_PIN_POSITION                               0x0
#define _CCP2PPS_PIN_SIZE                                   0x3
#define _CCP2PPS_PIN_LENGTH                                 0x3
#define _CCP2PPS_PIN_MASK                                   0x7
#define _CCP2PPS_PORT_POSN                                  0x3
#define _CCP2PPS_PORT_POSITION                              0x3
#define _CCP2PPS_PORT_SIZE                                  0x3
#define _CCP2PPS_PORT_LENGTH                                0x3
#define _CCP2PPS_PORT_MASK                                  0x38
#define _CCP2PPS_CCP2PPS0_POSN                              0x0
#define _CCP2PPS_CCP2PPS0_POSITION                          0x0
#define _CCP2PPS_CCP2PPS0_SIZE                              0x1
#define _CCP2PPS_CCP2PPS0_LENGTH                            0x1
#define _CCP2PPS_CCP2PPS0_MASK                              0x1
#define _CCP2PPS_CCP2PPS1_POSN                              0x1
#define _CCP2PPS_CCP2PPS1_POSITION                          0x1
#define _CCP2PPS_CCP2PPS1_SIZE                              0x1
#define _CCP2PPS_CCP2PPS1_LENGTH                            0x1
#define _CCP2PPS_CCP2PPS1_MASK                              0x2
#define _CCP2PPS_CCP2PPS2_POSN                              0x2
#define _CCP2PPS_CCP2PPS2_POSITION                          0x2
#define _CCP2PPS_CCP2PPS2_SIZE                              0x1
#define _CCP2PPS_CCP2PPS2_LENGTH                            0x1
#define _CCP2PPS_CCP2PPS2_MASK                              0x4
#define _CCP2PPS_CCP2PPS3_POSN                              0x3
#define _CCP2PPS_CCP2PPS3_POSITION                          0x3
#define _CCP2PPS_CCP2PPS3_SIZE                              0x1
#define _CCP2PPS_CCP2PPS3_LENGTH                            0x1
#define _CCP2PPS_CCP2PPS3_MASK                              0x8
#define _CCP2PPS_CCP2PPS4_POSN                              0x4
#define _CCP2PPS_CCP2PPS4_POSITION                          0x4
#define _CCP2PPS_CCP2PPS4_SIZE                              0x1
#define _CCP2PPS_CCP2PPS4_LENGTH                            0x1
#define _CCP2PPS_CCP2PPS4_MASK                              0x10
#define _CCP2PPS_CCP2PPS5_POSN                              0x5
#define _CCP2PPS_CCP2PPS5_POSITION                          0x5
#define _CCP2PPS_CCP2PPS5_SIZE                              0x1
#define _CCP2PPS_CCP2PPS5_LENGTH                            0x1
#define _CCP2PPS_CCP2PPS5_MASK                              0x20
#define _CCP2PPS_CCP2PPS_POSN                               0x0
#define _CCP2PPS_CCP2PPS_POSITION                           0x0
#define _CCP2PPS_CCP2PPS_SIZE                               0x6
#define _CCP2PPS_CCP2PPS_LENGTH                             0x6
#define _CCP2PPS_CCP2PPS_MASK                               0x3F

// Register: CCP3PPS
#define CCP3PPS CCP3PPS
extern volatile unsigned char           CCP3PPS             __at(0x251);
#ifndef _LIB_BUILD
asm("CCP3PPS equ 0251h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned CCP3PPS0               :1;
        unsigned CCP3PPS1               :1;
        unsigned CCP3PPS2               :1;
        unsigned CCP3PPS3               :1;
        unsigned CCP3PPS4               :1;
    };
    struct {
        unsigned CCP3PPS                :5;
    };
} CCP3PPSbits_t;
extern volatile CCP3PPSbits_t CCP3PPSbits __at(0x251);
// bitfield macros
#define _CCP3PPS_PIN_POSN                                   0x0
#define _CCP3PPS_PIN_POSITION                               0x0
#define _CCP3PPS_PIN_SIZE                                   0x3
#define _CCP3PPS_PIN_LENGTH                                 0x3
#define _CCP3PPS_PIN_MASK                                   0x7
#define _CCP3PPS_PORT_POSN                                  0x3
#define _CCP3PPS_PORT_POSITION                              0x3
#define _CCP3PPS_PORT_SIZE                                  0x2
#define _CCP3PPS_PORT_LENGTH                                0x2
#define _CCP3PPS_PORT_MASK                                  0x18
#define _CCP3PPS_CCP3PPS0_POSN                              0x0
#define _CCP3PPS_CCP3PPS0_POSITION                          0x0
#define _CCP3PPS_CCP3PPS0_SIZE                              0x1
#define _CCP3PPS_CCP3PPS0_LENGTH                            0x1
#define _CCP3PPS_CCP3PPS0_MASK                              0x1
#define _CCP3PPS_CCP3PPS1_POSN                              0x1
#define _CCP3PPS_CCP3PPS1_POSITION                          0x1
#define _CCP3PPS_CCP3PPS1_SIZE                              0x1
#define _CCP3PPS_CCP3PPS1_LENGTH                            0x1
#define _CCP3PPS_CCP3PPS1_MASK                              0x2
#define _CCP3PPS_CCP3PPS2_POSN                              0x2
#define _CCP3PPS_CCP3PPS2_POSITION                          0x2
#define _CCP3PPS_CCP3PPS2_SIZE                              0x1
#define _CCP3PPS_CCP3PPS2_LENGTH                            0x1
#define _CCP3PPS_CCP3PPS2_MASK                              0x4
#define _CCP3PPS_CCP3PPS3_POSN                              0x3
#define _CCP3PPS_CCP3PPS3_POSITION                          0x3
#define _CCP3PPS_CCP3PPS3_SIZE                              0x1
#define _CCP3PPS_CCP3PPS3_LENGTH                            0x1
#define _CCP3PPS_CCP3PPS3_MASK                              0x8
#define _CCP3PPS_CCP3PPS4_POSN                              0x4
#define _CCP3PPS_CCP3PPS4_POSITION                          0x4
#define _CCP3PPS_CCP3PPS4_SIZE                              0x1
#define _CCP3PPS_CCP3PPS4_LENGTH                            0x1
#define _CCP3PPS_CCP3PPS4_MASK                              0x10
#define _CCP3PPS_CCP3PPS_POSN                               0x0
#define _CCP3PPS_CCP3PPS_POSITION                           0x0
#define _CCP3PPS_CCP3PPS_SIZE                               0x5
#define _CCP3PPS_CCP3PPS_LENGTH                             0x5
#define _CCP3PPS_CCP3PPS_MASK                               0x1F

// Register: PWM1ERSPPS
#define PWM1ERSPPS PWM1ERSPPS
extern volatile unsigned char           PWM1ERSPPS          __at(0x253);
#ifndef _LIB_BUILD
asm("PWM1ERSPPS equ 0253h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned PWM1ERSPPS             :5;
    };
    struct {
        unsigned PWM1ERSPPS0            :1;
        unsigned PWM1ERSPPS1            :1;
        unsigned PWM1ERSPPS2            :1;
        unsigned PWM1ERSPPS3            :1;
        unsigned PWM1ERSPPS4            :1;
    };
} PWM1ERSPPSbits_t;
extern volatile PWM1ERSPPSbits_t PWM1ERSPPSbits __at(0x253);
// bitfield macros
#define _PWM1ERSPPS_PIN_POSN                                0x0
#define _PWM1ERSPPS_PIN_POSITION                            0x0
#define _PWM1ERSPPS_PIN_SIZE                                0x3
#define _PWM1ERSPPS_PIN_LENGTH                              0x3
#define _PWM1ERSPPS_PIN_MASK                                0x7
#define _PWM1ERSPPS_PORT_POSN                               0x3
#define _PWM1ERSPPS_PORT_POSITION                           0x3
#define _PWM1ERSPPS_PORT_SIZE                               0x2
#define _PWM1ERSPPS_PORT_LENGTH                             0x2
#define _PWM1ERSPPS_PORT_MASK                               0x18
#define _PWM1ERSPPS_PWM1ERSPPS_POSN                         0x0
#define _PWM1ERSPPS_PWM1ERSPPS_POSITION                     0x0
#define _PWM1ERSPPS_PWM1ERSPPS_SIZE                         0x5
#define _PWM1ERSPPS_PWM1ERSPPS_LENGTH                       0x5
#define _PWM1ERSPPS_PWM1ERSPPS_MASK                         0x1F
#define _PWM1ERSPPS_PWM1ERSPPS0_POSN                        0x0
#define _PWM1ERSPPS_PWM1ERSPPS0_POSITION                    0x0
#define _PWM1ERSPPS_PWM1ERSPPS0_SIZE                        0x1
#define _PWM1ERSPPS_PWM1ERSPPS0_LENGTH                      0x1
#define _PWM1ERSPPS_PWM1ERSPPS0_MASK                        0x1
#define _PWM1ERSPPS_PWM1ERSPPS1_POSN                        0x1
#define _PWM1ERSPPS_PWM1ERSPPS1_POSITION                    0x1
#define _PWM1ERSPPS_PWM1ERSPPS1_SIZE                        0x1
#define _PWM1ERSPPS_PWM1ERSPPS1_LENGTH                      0x1
#define _PWM1ERSPPS_PWM1ERSPPS1_MASK                        0x2
#define _PWM1ERSPPS_PWM1ERSPPS2_POSN                        0x2
#define _PWM1ERSPPS_PWM1ERSPPS2_POSITION                    0x2
#define _PWM1ERSPPS_PWM1ERSPPS2_SIZE                        0x1
#define _PWM1ERSPPS_PWM1ERSPPS2_LENGTH                      0x1
#define _PWM1ERSPPS_PWM1ERSPPS2_MASK                        0x4
#define _PWM1ERSPPS_PWM1ERSPPS3_POSN                        0x3
#define _PWM1ERSPPS_PWM1ERSPPS3_POSITION                    0x3
#define _PWM1ERSPPS_PWM1ERSPPS3_SIZE                        0x1
#define _PWM1ERSPPS_PWM1ERSPPS3_LENGTH                      0x1
#define _PWM1ERSPPS_PWM1ERSPPS3_MASK                        0x8
#define _PWM1ERSPPS_PWM1ERSPPS4_POSN                        0x4
#define _PWM1ERSPPS_PWM1ERSPPS4_POSITION                    0x4
#define _PWM1ERSPPS_PWM1ERSPPS4_SIZE                        0x1
#define _PWM1ERSPPS_PWM1ERSPPS4_LENGTH                      0x1
#define _PWM1ERSPPS_PWM1ERSPPS4_MASK                        0x10

// Register: PWM2ERSPPS
#define PWM2ERSPPS PWM2ERSPPS
extern volatile unsigned char           PWM2ERSPPS          __at(0x254);
#ifndef _LIB_BUILD
asm("PWM2ERSPPS equ 0254h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned PWM2ERSPPS             :6;
    };
    struct {
        unsigned PWM2ERSPPS0            :1;
        unsigned PWM2ERSPPS1            :1;
        unsigned PWM2ERSPPS2            :1;
        unsigned PWM2ERSPPS3            :1;
        unsigned PWM2ERSPPS4            :1;
        unsigned PWM2ERSPPS5            :1;
    };
} PWM2ERSPPSbits_t;
