GopalSaraf/Practicals/PSDL/include/proc/pic18f25q43.h
// Register: NCO3INCL
#define NCO3INCL NCO3INCL
extern volatile unsigned char           NCO3INCL            __at(0x453);
#ifndef _LIB_BUILD
asm("NCO3INCL equ 0453h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INC                    :8;
    };
    struct {
        unsigned NCO3INC0               :1;
        unsigned NCO3INC1               :1;
        unsigned NCO3INC2               :1;
        unsigned NCO3INC3               :1;
        unsigned NCO3INC4               :1;
        unsigned NCO3INC5               :1;
        unsigned NCO3INC6               :1;
        unsigned NCO3INC7               :1;
    };
    struct {
        unsigned INC0                   :1;
        unsigned INC1                   :1;
        unsigned INC2                   :1;
        unsigned INC3                   :1;
        unsigned INC4                   :1;
        unsigned INC5                   :1;
        unsigned INC6                   :1;
        unsigned INC7                   :1;
    };
    struct {
        unsigned NCO3INC                :8;
    };
} NCO3INCLbits_t;
extern volatile NCO3INCLbits_t NCO3INCLbits __at(0x453);
// bitfield macros
#define _NCO3INCL_INC_POSN                                  0x0
#define _NCO3INCL_INC_POSITION                              0x0
#define _NCO3INCL_INC_SIZE                                  0x8
#define _NCO3INCL_INC_LENGTH                                0x8
#define _NCO3INCL_INC_MASK                                  0xFF
#define _NCO3INCL_NCO3INC0_POSN                             0x0
#define _NCO3INCL_NCO3INC0_POSITION                         0x0
#define _NCO3INCL_NCO3INC0_SIZE                             0x1
#define _NCO3INCL_NCO3INC0_LENGTH                           0x1
#define _NCO3INCL_NCO3INC0_MASK                             0x1
#define _NCO3INCL_NCO3INC1_POSN                             0x1
#define _NCO3INCL_NCO3INC1_POSITION                         0x1
#define _NCO3INCL_NCO3INC1_SIZE                             0x1
#define _NCO3INCL_NCO3INC1_LENGTH                           0x1
#define _NCO3INCL_NCO3INC1_MASK                             0x2
#define _NCO3INCL_NCO3INC2_POSN                             0x2
#define _NCO3INCL_NCO3INC2_POSITION                         0x2
#define _NCO3INCL_NCO3INC2_SIZE                             0x1
#define _NCO3INCL_NCO3INC2_LENGTH                           0x1
#define _NCO3INCL_NCO3INC2_MASK                             0x4
#define _NCO3INCL_NCO3INC3_POSN                             0x3
#define _NCO3INCL_NCO3INC3_POSITION                         0x3
#define _NCO3INCL_NCO3INC3_SIZE                             0x1
#define _NCO3INCL_NCO3INC3_LENGTH                           0x1
#define _NCO3INCL_NCO3INC3_MASK                             0x8
#define _NCO3INCL_NCO3INC4_POSN                             0x4
#define _NCO3INCL_NCO3INC4_POSITION                         0x4
#define _NCO3INCL_NCO3INC4_SIZE                             0x1
#define _NCO3INCL_NCO3INC4_LENGTH                           0x1
#define _NCO3INCL_NCO3INC4_MASK                             0x10
#define _NCO3INCL_NCO3INC5_POSN                             0x5
#define _NCO3INCL_NCO3INC5_POSITION                         0x5
#define _NCO3INCL_NCO3INC5_SIZE                             0x1
#define _NCO3INCL_NCO3INC5_LENGTH                           0x1
#define _NCO3INCL_NCO3INC5_MASK                             0x20
#define _NCO3INCL_NCO3INC6_POSN                             0x6
#define _NCO3INCL_NCO3INC6_POSITION                         0x6
#define _NCO3INCL_NCO3INC6_SIZE                             0x1
#define _NCO3INCL_NCO3INC6_LENGTH                           0x1
#define _NCO3INCL_NCO3INC6_MASK                             0x40
#define _NCO3INCL_NCO3INC7_POSN                             0x7
#define _NCO3INCL_NCO3INC7_POSITION                         0x7
#define _NCO3INCL_NCO3INC7_SIZE                             0x1
#define _NCO3INCL_NCO3INC7_LENGTH                           0x1
#define _NCO3INCL_NCO3INC7_MASK                             0x80
#define _NCO3INCL_INC0_POSN                                 0x0
#define _NCO3INCL_INC0_POSITION                             0x0
#define _NCO3INCL_INC0_SIZE                                 0x1
#define _NCO3INCL_INC0_LENGTH                               0x1
#define _NCO3INCL_INC0_MASK                                 0x1
#define _NCO3INCL_INC1_POSN                                 0x1
#define _NCO3INCL_INC1_POSITION                             0x1
#define _NCO3INCL_INC1_SIZE                                 0x1
#define _NCO3INCL_INC1_LENGTH                               0x1
#define _NCO3INCL_INC1_MASK                                 0x2
#define _NCO3INCL_INC2_POSN                                 0x2
#define _NCO3INCL_INC2_POSITION                             0x2
#define _NCO3INCL_INC2_SIZE                                 0x1
#define _NCO3INCL_INC2_LENGTH                               0x1
#define _NCO3INCL_INC2_MASK                                 0x4
#define _NCO3INCL_INC3_POSN                                 0x3
#define _NCO3INCL_INC3_POSITION                             0x3
#define _NCO3INCL_INC3_SIZE                                 0x1
#define _NCO3INCL_INC3_LENGTH                               0x1
#define _NCO3INCL_INC3_MASK                                 0x8
#define _NCO3INCL_INC4_POSN                                 0x4
#define _NCO3INCL_INC4_POSITION                             0x4
#define _NCO3INCL_INC4_SIZE                                 0x1
#define _NCO3INCL_INC4_LENGTH                               0x1
#define _NCO3INCL_INC4_MASK                                 0x10
#define _NCO3INCL_INC5_POSN                                 0x5
#define _NCO3INCL_INC5_POSITION                             0x5
#define _NCO3INCL_INC5_SIZE                                 0x1
#define _NCO3INCL_INC5_LENGTH                               0x1
#define _NCO3INCL_INC5_MASK                                 0x20
#define _NCO3INCL_INC6_POSN                                 0x6
#define _NCO3INCL_INC6_POSITION                             0x6
#define _NCO3INCL_INC6_SIZE                                 0x1
#define _NCO3INCL_INC6_LENGTH                               0x1
#define _NCO3INCL_INC6_MASK                                 0x40
#define _NCO3INCL_INC7_POSN                                 0x7
#define _NCO3INCL_INC7_POSITION                             0x7
#define _NCO3INCL_INC7_SIZE                                 0x1
#define _NCO3INCL_INC7_LENGTH                               0x1
#define _NCO3INCL_INC7_MASK                                 0x80
#define _NCO3INCL_NCO3INC_POSN                              0x0
#define _NCO3INCL_NCO3INC_POSITION                          0x0
#define _NCO3INCL_NCO3INC_SIZE                              0x8
#define _NCO3INCL_NCO3INC_LENGTH                            0x8
#define _NCO3INCL_NCO3INC_MASK                              0xFF

// Register: NCO3INCH
#define NCO3INCH NCO3INCH
extern volatile unsigned char           NCO3INCH            __at(0x454);
#ifndef _LIB_BUILD
asm("NCO3INCH equ 0454h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INC                    :8;
    };
    struct {
        unsigned NCO3INC8               :1;
        unsigned NCO3INC9               :1;
        unsigned NCO3INC10              :1;
        unsigned NCO3INC11              :1;
        unsigned NCO3INC12              :1;
        unsigned NCO3INC13              :1;
        unsigned NCO3INC14              :1;
        unsigned NCO3INC15              :1;
    };
    struct {
        unsigned INC8                   :1;
        unsigned INC9                   :1;
        unsigned INC10                  :1;
        unsigned INC11                  :1;
        unsigned INC12                  :1;
        unsigned INC13                  :1;
        unsigned INC14                  :1;
        unsigned INC15                  :1;
    };
    struct {
        unsigned NCO3INC                :8;
    };
} NCO3INCHbits_t;
extern volatile NCO3INCHbits_t NCO3INCHbits __at(0x454);
// bitfield macros
#define _NCO3INCH_INC_POSN                                  0x0
#define _NCO3INCH_INC_POSITION                              0x0
#define _NCO3INCH_INC_SIZE                                  0x8
#define _NCO3INCH_INC_LENGTH                                0x8
#define _NCO3INCH_INC_MASK                                  0xFF
#define _NCO3INCH_NCO3INC8_POSN                             0x0
#define _NCO3INCH_NCO3INC8_POSITION                         0x0
#define _NCO3INCH_NCO3INC8_SIZE                             0x1
#define _NCO3INCH_NCO3INC8_LENGTH                           0x1
#define _NCO3INCH_NCO3INC8_MASK                             0x1
#define _NCO3INCH_NCO3INC9_POSN                             0x1
#define _NCO3INCH_NCO3INC9_POSITION                         0x1
#define _NCO3INCH_NCO3INC9_SIZE                             0x1
#define _NCO3INCH_NCO3INC9_LENGTH                           0x1
#define _NCO3INCH_NCO3INC9_MASK                             0x2
#define _NCO3INCH_NCO3INC10_POSN                            0x2
#define _NCO3INCH_NCO3INC10_POSITION                        0x2
#define _NCO3INCH_NCO3INC10_SIZE                            0x1
#define _NCO3INCH_NCO3INC10_LENGTH                          0x1
#define _NCO3INCH_NCO3INC10_MASK                            0x4
#define _NCO3INCH_NCO3INC11_POSN                            0x3
#define _NCO3INCH_NCO3INC11_POSITION                        0x3
#define _NCO3INCH_NCO3INC11_SIZE                            0x1
#define _NCO3INCH_NCO3INC11_LENGTH                          0x1
#define _NCO3INCH_NCO3INC11_MASK                            0x8
#define _NCO3INCH_NCO3INC12_POSN                            0x4
#define _NCO3INCH_NCO3INC12_POSITION                        0x4
#define _NCO3INCH_NCO3INC12_SIZE                            0x1
#define _NCO3INCH_NCO3INC12_LENGTH                          0x1
#define _NCO3INCH_NCO3INC12_MASK                            0x10
#define _NCO3INCH_NCO3INC13_POSN                            0x5
#define _NCO3INCH_NCO3INC13_POSITION                        0x5
#define _NCO3INCH_NCO3INC13_SIZE                            0x1
#define _NCO3INCH_NCO3INC13_LENGTH                          0x1
#define _NCO3INCH_NCO3INC13_MASK                            0x20
#define _NCO3INCH_NCO3INC14_POSN                            0x6
#define _NCO3INCH_NCO3INC14_POSITION                        0x6
#define _NCO3INCH_NCO3INC14_SIZE                            0x1
#define _NCO3INCH_NCO3INC14_LENGTH                          0x1
#define _NCO3INCH_NCO3INC14_MASK                            0x40
#define _NCO3INCH_NCO3INC15_POSN                            0x7
#define _NCO3INCH_NCO3INC15_POSITION                        0x7
#define _NCO3INCH_NCO3INC15_SIZE                            0x1
#define _NCO3INCH_NCO3INC15_LENGTH                          0x1
#define _NCO3INCH_NCO3INC15_MASK                            0x80
#define _NCO3INCH_INC8_POSN                                 0x0
#define _NCO3INCH_INC8_POSITION                             0x0
#define _NCO3INCH_INC8_SIZE                                 0x1
#define _NCO3INCH_INC8_LENGTH                               0x1
#define _NCO3INCH_INC8_MASK                                 0x1
#define _NCO3INCH_INC9_POSN                                 0x1
#define _NCO3INCH_INC9_POSITION                             0x1
#define _NCO3INCH_INC9_SIZE                                 0x1
#define _NCO3INCH_INC9_LENGTH                               0x1
#define _NCO3INCH_INC9_MASK                                 0x2
#define _NCO3INCH_INC10_POSN                                0x2
#define _NCO3INCH_INC10_POSITION                            0x2
#define _NCO3INCH_INC10_SIZE                                0x1
#define _NCO3INCH_INC10_LENGTH                              0x1
#define _NCO3INCH_INC10_MASK                                0x4
#define _NCO3INCH_INC11_POSN                                0x3
#define _NCO3INCH_INC11_POSITION                            0x3
#define _NCO3INCH_INC11_SIZE                                0x1
#define _NCO3INCH_INC11_LENGTH                              0x1
#define _NCO3INCH_INC11_MASK                                0x8
#define _NCO3INCH_INC12_POSN                                0x4
#define _NCO3INCH_INC12_POSITION                            0x4
#define _NCO3INCH_INC12_SIZE                                0x1
#define _NCO3INCH_INC12_LENGTH                              0x1
#define _NCO3INCH_INC12_MASK                                0x10
#define _NCO3INCH_INC13_POSN                                0x5
#define _NCO3INCH_INC13_POSITION                            0x5
#define _NCO3INCH_INC13_SIZE                                0x1
#define _NCO3INCH_INC13_LENGTH                              0x1
#define _NCO3INCH_INC13_MASK                                0x20
#define _NCO3INCH_INC14_POSN                                0x6
#define _NCO3INCH_INC14_POSITION                            0x6
#define _NCO3INCH_INC14_SIZE                                0x1
#define _NCO3INCH_INC14_LENGTH                              0x1
#define _NCO3INCH_INC14_MASK                                0x40
#define _NCO3INCH_INC15_POSN                                0x7
#define _NCO3INCH_INC15_POSITION                            0x7
#define _NCO3INCH_INC15_SIZE                                0x1
#define _NCO3INCH_INC15_LENGTH                              0x1
#define _NCO3INCH_INC15_MASK                                0x80
#define _NCO3INCH_NCO3INC_POSN                              0x0
#define _NCO3INCH_NCO3INC_POSITION                          0x0
#define _NCO3INCH_NCO3INC_SIZE                              0x8
#define _NCO3INCH_NCO3INC_LENGTH                            0x8
#define _NCO3INCH_NCO3INC_MASK                              0xFF

