GopalSaraf/Practicals/PSDL/include/proc/pic18f25q43.h
extern volatile INTCON0bits_t INTCON0bits __at(0x4D6);
// bitfield macros
#define _INTCON0_INT0EDG_POSN                               0x0
#define _INTCON0_INT0EDG_POSITION                           0x0
#define _INTCON0_INT0EDG_SIZE                               0x1
#define _INTCON0_INT0EDG_LENGTH                             0x1
#define _INTCON0_INT0EDG_MASK                               0x1
#define _INTCON0_INT1EDG_POSN                               0x1
#define _INTCON0_INT1EDG_POSITION                           0x1
#define _INTCON0_INT1EDG_SIZE                               0x1
#define _INTCON0_INT1EDG_LENGTH                             0x1
#define _INTCON0_INT1EDG_MASK                               0x2
#define _INTCON0_INT2EDG_POSN                               0x2
#define _INTCON0_INT2EDG_POSITION                           0x2
#define _INTCON0_INT2EDG_SIZE                               0x1
#define _INTCON0_INT2EDG_LENGTH                             0x1
#define _INTCON0_INT2EDG_MASK                               0x4
#define _INTCON0_IPEN_POSN                                  0x5
#define _INTCON0_IPEN_POSITION                              0x5
#define _INTCON0_IPEN_SIZE                                  0x1
#define _INTCON0_IPEN_LENGTH                                0x1
#define _INTCON0_IPEN_MASK                                  0x20
#define _INTCON0_GIEL_POSN                                  0x6
#define _INTCON0_GIEL_POSITION                              0x6
#define _INTCON0_GIEL_SIZE                                  0x1
#define _INTCON0_GIEL_LENGTH                                0x1
#define _INTCON0_GIEL_MASK                                  0x40
#define _INTCON0_GIE_POSN                                   0x7
#define _INTCON0_GIE_POSITION                               0x7
#define _INTCON0_GIE_SIZE                                   0x1
#define _INTCON0_GIE_LENGTH                                 0x1
#define _INTCON0_GIE_MASK                                   0x80
#define _INTCON0_GIEH_POSN                                  0x7
#define _INTCON0_GIEH_POSITION                              0x7
#define _INTCON0_GIEH_SIZE                                  0x1
#define _INTCON0_GIEH_LENGTH                                0x1
#define _INTCON0_GIEH_MASK                                  0x80

// Register: INTCON1
#define INTCON1 INTCON1
extern volatile unsigned char           INTCON1             __at(0x4D7);
#ifndef _LIB_BUILD
asm("INTCON1 equ 04D7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :6;
        unsigned STAT                   :2;
    };
    struct {
        unsigned                        :6;
        unsigned STAT0                  :1;
        unsigned STAT1                  :1;
    };
} INTCON1bits_t;
extern volatile INTCON1bits_t INTCON1bits __at(0x4D7);
// bitfield macros
#define _INTCON1_STAT_POSN                                  0x6
#define _INTCON1_STAT_POSITION                              0x6
#define _INTCON1_STAT_SIZE                                  0x2
#define _INTCON1_STAT_LENGTH                                0x2
#define _INTCON1_STAT_MASK                                  0xC0
#define _INTCON1_STAT0_POSN                                 0x6
#define _INTCON1_STAT0_POSITION                             0x6
#define _INTCON1_STAT0_SIZE                                 0x1
#define _INTCON1_STAT0_LENGTH                               0x1
#define _INTCON1_STAT0_MASK                                 0x40
#define _INTCON1_STAT1_POSN                                 0x7
#define _INTCON1_STAT1_POSITION                             0x7
#define _INTCON1_STAT1_SIZE                                 0x1
#define _INTCON1_STAT1_LENGTH                               0x1
#define _INTCON1_STAT1_MASK                                 0x80

// Register: STATUS
#define STATUS STATUS
extern volatile unsigned char           STATUS              __at(0x4D8);
#ifndef _LIB_BUILD
asm("STATUS equ 04D8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :5;
        unsigned NOT_PD                 :1;
    };
    struct {
        unsigned                        :6;
        unsigned NOT_TO                 :1;
    };
    struct {
        unsigned C                      :1;
        unsigned DC                     :1;
        unsigned Z                      :1;
        unsigned OV                     :1;
        unsigned N                      :1;
        unsigned nPD                    :1;
        unsigned nTO                    :1;
    };
    struct {
        unsigned                        :5;
        unsigned PD                     :1;
        unsigned TO                     :1;
    };
} STATUSbits_t;
extern volatile STATUSbits_t STATUSbits __at(0x4D8);
// bitfield macros
#define _STATUS_NOT_PD_POSN                                 0x5
#define _STATUS_NOT_PD_POSITION                             0x5
#define _STATUS_NOT_PD_SIZE                                 0x1
#define _STATUS_NOT_PD_LENGTH                               0x1
#define _STATUS_NOT_PD_MASK                                 0x20
#define _STATUS_NOT_TO_POSN                                 0x6
#define _STATUS_NOT_TO_POSITION                             0x6
#define _STATUS_NOT_TO_SIZE                                 0x1
#define _STATUS_NOT_TO_LENGTH                               0x1
#define _STATUS_NOT_TO_MASK                                 0x40
#define _STATUS_C_POSN                                      0x0
#define _STATUS_C_POSITION                                  0x0
#define _STATUS_C_SIZE                                      0x1
#define _STATUS_C_LENGTH                                    0x1
#define _STATUS_C_MASK                                      0x1
#define _STATUS_DC_POSN                                     0x1
#define _STATUS_DC_POSITION                                 0x1
#define _STATUS_DC_SIZE                                     0x1
#define _STATUS_DC_LENGTH                                   0x1
#define _STATUS_DC_MASK                                     0x2
#define _STATUS_Z_POSN                                      0x2
#define _STATUS_Z_POSITION                                  0x2
#define _STATUS_Z_SIZE                                      0x1
#define _STATUS_Z_LENGTH                                    0x1
#define _STATUS_Z_MASK                                      0x4
#define _STATUS_OV_POSN                                     0x3
#define _STATUS_OV_POSITION                                 0x3
#define _STATUS_OV_SIZE                                     0x1
#define _STATUS_OV_LENGTH                                   0x1
#define _STATUS_OV_MASK                                     0x8
#define _STATUS_N_POSN                                      0x4
#define _STATUS_N_POSITION                                  0x4
#define _STATUS_N_SIZE                                      0x1
#define _STATUS_N_LENGTH                                    0x1
#define _STATUS_N_MASK                                      0x10
#define _STATUS_nPD_POSN                                    0x5
#define _STATUS_nPD_POSITION                                0x5
#define _STATUS_nPD_SIZE                                    0x1
#define _STATUS_nPD_LENGTH                                  0x1
#define _STATUS_nPD_MASK                                    0x20
#define _STATUS_nTO_POSN                                    0x6
#define _STATUS_nTO_POSITION                                0x6
#define _STATUS_nTO_SIZE                                    0x1
#define _STATUS_nTO_LENGTH                                  0x1
#define _STATUS_nTO_MASK                                    0x40
#define _STATUS_PD_POSN                                     0x5
#define _STATUS_PD_POSITION                                 0x5
#define _STATUS_PD_SIZE                                     0x1
#define _STATUS_PD_LENGTH                                   0x1
#define _STATUS_PD_MASK                                     0x20
#define _STATUS_TO_POSN                                     0x6
#define _STATUS_TO_POSITION                                 0x6
#define _STATUS_TO_SIZE                                     0x1
#define _STATUS_TO_LENGTH                                   0x1
#define _STATUS_TO_MASK                                     0x40

// Register: FSR2
#define FSR2 FSR2
extern volatile unsigned short          FSR2                __at(0x4D9);
#ifndef _LIB_BUILD
asm("FSR2 equ 04D9h");
#endif

// Register: FSR2L
#define FSR2L FSR2L
extern volatile unsigned char           FSR2L               __at(0x4D9);
#ifndef _LIB_BUILD
asm("FSR2L equ 04D9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSR2L                  :8;
    };
} FSR2Lbits_t;
extern volatile FSR2Lbits_t FSR2Lbits __at(0x4D9);
// bitfield macros
#define _FSR2L_FSR2L_POSN                                   0x0
#define _FSR2L_FSR2L_POSITION                               0x0
#define _FSR2L_FSR2L_SIZE                                   0x8
#define _FSR2L_FSR2L_LENGTH                                 0x8
#define _FSR2L_FSR2L_MASK                                   0xFF

// Register: FSR2H
#define FSR2H FSR2H
extern volatile unsigned char           FSR2H               __at(0x4DA);
#ifndef _LIB_BUILD
asm("FSR2H equ 04DAh");
#endif

// Register: PLUSW2
#define PLUSW2 PLUSW2
extern volatile unsigned char           PLUSW2              __at(0x4DB);
#ifndef _LIB_BUILD
asm("PLUSW2 equ 04DBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PLUSW2                 :8;
    };
} PLUSW2bits_t;
