GopalSaraf/Practicals/PSDL/include/proc/pic18f25q43.h
extern volatile __bit                   LADR4               __at(0x1AD4);	// @ (0x35A * 8 + 4)
#define                                 LADR4_bit           _BIT_ACCESS(SCANLADRL,4)
// SCANLADRL<LADR5>
extern volatile __bit                   LADR5               __at(0x1AD5);	// @ (0x35A * 8 + 5)
#define                                 LADR5_bit           _BIT_ACCESS(SCANLADRL,5)
// SCANLADRL<LADR6>
extern volatile __bit                   LADR6               __at(0x1AD6);	// @ (0x35A * 8 + 6)
#define                                 LADR6_bit           _BIT_ACCESS(SCANLADRL,6)
// SCANLADRL<LADR7>
extern volatile __bit                   LADR7               __at(0x1AD7);	// @ (0x35A * 8 + 7)
#define                                 LADR7_bit           _BIT_ACCESS(SCANLADRL,7)
// SCANLADRH<LADR8>
extern volatile __bit                   LADR8               __at(0x1AD8);	// @ (0x35B * 8 + 0)
#define                                 LADR8_bit           _BIT_ACCESS(SCANLADRH,0)
// SCANLADRH<LADR9>
extern volatile __bit                   LADR9               __at(0x1AD9);	// @ (0x35B * 8 + 1)
#define                                 LADR9_bit           _BIT_ACCESS(SCANLADRH,1)
// LATA<LATA0>
extern volatile __bit                   LATA0               __at(0x25F0);	// @ (0x4BE * 8 + 0)
#define                                 LATA0_bit           _BIT_ACCESS(LATA,0)
// LATA<LATA1>
extern volatile __bit                   LATA1               __at(0x25F1);	// @ (0x4BE * 8 + 1)
#define                                 LATA1_bit           _BIT_ACCESS(LATA,1)
// LATA<LATA2>
extern volatile __bit                   LATA2               __at(0x25F2);	// @ (0x4BE * 8 + 2)
#define                                 LATA2_bit           _BIT_ACCESS(LATA,2)
// LATA<LATA3>
extern volatile __bit                   LATA3               __at(0x25F3);	// @ (0x4BE * 8 + 3)
#define                                 LATA3_bit           _BIT_ACCESS(LATA,3)
// LATA<LATA4>
extern volatile __bit                   LATA4               __at(0x25F4);	// @ (0x4BE * 8 + 4)
#define                                 LATA4_bit           _BIT_ACCESS(LATA,4)
// LATA<LATA5>
extern volatile __bit                   LATA5               __at(0x25F5);	// @ (0x4BE * 8 + 5)
#define                                 LATA5_bit           _BIT_ACCESS(LATA,5)
// LATA<LATA6>
extern volatile __bit                   LATA6               __at(0x25F6);	// @ (0x4BE * 8 + 6)
#define                                 LATA6_bit           _BIT_ACCESS(LATA,6)
// LATA<LATA7>
extern volatile __bit                   LATA7               __at(0x25F7);	// @ (0x4BE * 8 + 7)
#define                                 LATA7_bit           _BIT_ACCESS(LATA,7)
// LATB<LATB0>
extern volatile __bit                   LATB0               __at(0x25F8);	// @ (0x4BF * 8 + 0)
#define                                 LATB0_bit           _BIT_ACCESS(LATB,0)
// LATB<LATB1>
extern volatile __bit                   LATB1               __at(0x25F9);	// @ (0x4BF * 8 + 1)
#define                                 LATB1_bit           _BIT_ACCESS(LATB,1)
// LATB<LATB2>
extern volatile __bit                   LATB2               __at(0x25FA);	// @ (0x4BF * 8 + 2)
#define                                 LATB2_bit           _BIT_ACCESS(LATB,2)
// LATB<LATB3>
extern volatile __bit                   LATB3               __at(0x25FB);	// @ (0x4BF * 8 + 3)
#define                                 LATB3_bit           _BIT_ACCESS(LATB,3)
// LATB<LATB4>
extern volatile __bit                   LATB4               __at(0x25FC);	// @ (0x4BF * 8 + 4)
#define                                 LATB4_bit           _BIT_ACCESS(LATB,4)
// LATB<LATB5>
extern volatile __bit                   LATB5               __at(0x25FD);	// @ (0x4BF * 8 + 5)
#define                                 LATB5_bit           _BIT_ACCESS(LATB,5)
// LATB<LATB6>
extern volatile __bit                   LATB6               __at(0x25FE);	// @ (0x4BF * 8 + 6)
#define                                 LATB6_bit           _BIT_ACCESS(LATB,6)
// LATB<LATB7>
extern volatile __bit                   LATB7               __at(0x25FF);	// @ (0x4BF * 8 + 7)
#define                                 LATB7_bit           _BIT_ACCESS(LATB,7)
// LATC<LATC0>
extern volatile __bit                   LATC0               __at(0x2600);	// @ (0x4C0 * 8 + 0)
#define                                 LATC0_bit           _BIT_ACCESS(LATC,0)
// LATC<LATC1>
extern volatile __bit                   LATC1               __at(0x2601);	// @ (0x4C0 * 8 + 1)
#define                                 LATC1_bit           _BIT_ACCESS(LATC,1)
// LATC<LATC2>
extern volatile __bit                   LATC2               __at(0x2602);	// @ (0x4C0 * 8 + 2)
#define                                 LATC2_bit           _BIT_ACCESS(LATC,2)
// LATC<LATC3>
extern volatile __bit                   LATC3               __at(0x2603);	// @ (0x4C0 * 8 + 3)
#define                                 LATC3_bit           _BIT_ACCESS(LATC,3)
// LATC<LATC4>
extern volatile __bit                   LATC4               __at(0x2604);	// @ (0x4C0 * 8 + 4)
#define                                 LATC4_bit           _BIT_ACCESS(LATC,4)
// LATC<LATC5>
extern volatile __bit                   LATC5               __at(0x2605);	// @ (0x4C0 * 8 + 5)
#define                                 LATC5_bit           _BIT_ACCESS(LATC,5)
// LATC<LATC6>
extern volatile __bit                   LATC6               __at(0x2606);	// @ (0x4C0 * 8 + 6)
#define                                 LATC6_bit           _BIT_ACCESS(LATC,6)
// LATC<LATC7>
extern volatile __bit                   LATC7               __at(0x2607);	// @ (0x4C0 * 8 + 7)
#define                                 LATC7_bit           _BIT_ACCESS(LATC,7)
// LATD<LATD0>
extern volatile __bit                   LATD0               __at(0x2608);	// @ (0x4C1 * 8 + 0)
#define                                 LATD0_bit           _BIT_ACCESS(LATD,0)
// LATD<LATD1>
extern volatile __bit                   LATD1               __at(0x2609);	// @ (0x4C1 * 8 + 1)
#define                                 LATD1_bit           _BIT_ACCESS(LATD,1)
// LATD<LATD2>
extern volatile __bit                   LATD2               __at(0x260A);	// @ (0x4C1 * 8 + 2)
#define                                 LATD2_bit           _BIT_ACCESS(LATD,2)
// LATD<LATD3>
extern volatile __bit                   LATD3               __at(0x260B);	// @ (0x4C1 * 8 + 3)
#define                                 LATD3_bit           _BIT_ACCESS(LATD,3)
// LATD<LATD4>
extern volatile __bit                   LATD4               __at(0x260C);	// @ (0x4C1 * 8 + 4)
#define                                 LATD4_bit           _BIT_ACCESS(LATD,4)
// LATD<LATD5>
extern volatile __bit                   LATD5               __at(0x260D);	// @ (0x4C1 * 8 + 5)
#define                                 LATD5_bit           _BIT_ACCESS(LATD,5)
// LATD<LATD6>
extern volatile __bit                   LATD6               __at(0x260E);	// @ (0x4C1 * 8 + 6)
#define                                 LATD6_bit           _BIT_ACCESS(LATD,6)
// LATD<LATD7>
extern volatile __bit                   LATD7               __at(0x260F);	// @ (0x4C1 * 8 + 7)
#define                                 LATD7_bit           _BIT_ACCESS(LATD,7)
// OSCEN<LFOEN>
extern volatile __bit                   LFOEN               __at(0x59C);	// @ (0xB3 * 8 + 4)
#define                                 LFOEN_bit           _BIT_ACCESS(OSCEN,4)
// OSCSTAT<LFOR>
extern volatile __bit                   LFOR                __at(0x594);	// @ (0xB2 * 8 + 4)
#define                                 LFOR_bit            _BIT_ACCESS(OSCSTAT,4)
// ACTCON<LOCK>
extern volatile __bit                   LOCK                __at(0x563);	// @ (0xAC * 8 + 3)
#define                                 LOCK_bit            _BIT_ACCESS(ACTCON,3)
// ADLTHL<LTH0>
extern volatile __bit                   LTH0                __at(0x1EC8);	// @ (0x3D9 * 8 + 0)
#define                                 LTH0_bit            _BIT_ACCESS(ADLTHL,0)
// ADLTHL<LTH1>
extern volatile __bit                   LTH1                __at(0x1EC9);	// @ (0x3D9 * 8 + 1)
#define                                 LTH1_bit            _BIT_ACCESS(ADLTHL,1)
// ADLTHH<LTH10>
extern volatile __bit                   LTH10               __at(0x1ED2);	// @ (0x3DA * 8 + 2)
#define                                 LTH10_bit           _BIT_ACCESS(ADLTHH,2)
// ADLTHH<LTH11>
extern volatile __bit                   LTH11               __at(0x1ED3);	// @ (0x3DA * 8 + 3)
#define                                 LTH11_bit           _BIT_ACCESS(ADLTHH,3)
// ADLTHH<LTH12>
extern volatile __bit                   LTH12               __at(0x1ED4);	// @ (0x3DA * 8 + 4)
#define                                 LTH12_bit           _BIT_ACCESS(ADLTHH,4)
// ADLTHH<LTH13>
extern volatile __bit                   LTH13               __at(0x1ED5);	// @ (0x3DA * 8 + 5)
#define                                 LTH13_bit           _BIT_ACCESS(ADLTHH,5)
// ADLTHH<LTH14>
extern volatile __bit                   LTH14               __at(0x1ED6);	// @ (0x3DA * 8 + 6)
#define                                 LTH14_bit           _BIT_ACCESS(ADLTHH,6)
// ADLTHH<LTH15>
extern volatile __bit                   LTH15               __at(0x1ED7);	// @ (0x3DA * 8 + 7)
#define                                 LTH15_bit           _BIT_ACCESS(ADLTHH,7)
// ADLTHL<LTH2>
extern volatile __bit                   LTH2                __at(0x1ECA);	// @ (0x3D9 * 8 + 2)
#define                                 LTH2_bit            _BIT_ACCESS(ADLTHL,2)
// ADLTHL<LTH3>
extern volatile __bit                   LTH3                __at(0x1ECB);	// @ (0x3D9 * 8 + 3)
#define                                 LTH3_bit            _BIT_ACCESS(ADLTHL,3)
// ADLTHL<LTH4>
extern volatile __bit                   LTH4                __at(0x1ECC);	// @ (0x3D9 * 8 + 4)
#define                                 LTH4_bit            _BIT_ACCESS(ADLTHL,4)
// ADLTHL<LTH5>
extern volatile __bit                   LTH5                __at(0x1ECD);	// @ (0x3D9 * 8 + 5)
#define                                 LTH5_bit            _BIT_ACCESS(ADLTHL,5)
// ADLTHL<LTH6>
extern volatile __bit                   LTH6                __at(0x1ECE);	// @ (0x3D9 * 8 + 6)
#define                                 LTH6_bit            _BIT_ACCESS(ADLTHL,6)
// ADLTHL<LTH7>
extern volatile __bit                   LTH7                __at(0x1ECF);	// @ (0x3D9 * 8 + 7)
#define                                 LTH7_bit            _BIT_ACCESS(ADLTHL,7)
// ADLTHH<LTH8>
extern volatile __bit                   LTH8                __at(0x1ED0);	// @ (0x3DA * 8 + 0)
#define                                 LTH8_bit            _BIT_ACCESS(ADLTHH,0)
// ADLTHH<LTH9>
extern volatile __bit                   LTH9                __at(0x1ED1);	// @ (0x3DA * 8 + 1)
#define                                 LTH9_bit            _BIT_ACCESS(ADLTHH,1)
// ADSTAT<LTHR>
extern volatile __bit                   LTHR                __at(0x1FBD);	// @ (0x3F7 * 8 + 5)
#define                                 LTHR_bit            _BIT_ACCESS(ADSTAT,5)
// MAINPR<MAINPR0>
extern volatile __bit                   MAINPR0             __at(0x5F0);	// @ (0xBE * 8 + 0)
#define                                 MAINPR0_bit         _BIT_ACCESS(MAINPR,0)
// MAINPR<MAINPR1>
extern volatile __bit                   MAINPR1             __at(0x5F1);	// @ (0xBE * 8 + 1)
#define                                 MAINPR1_bit         _BIT_ACCESS(MAINPR,1)
// MAINPR<MAINPR2>
extern volatile __bit                   MAINPR2             __at(0x5F2);	// @ (0xBE * 8 + 2)
#define                                 MAINPR2_bit         _BIT_ACCESS(MAINPR,2)
// ADSTAT<MATH>
extern volatile __bit                   MATH                __at(0x1FBC);	// @ (0x3F7 * 8 + 4)
#define                                 MATH_bit            _BIT_ACCESS(ADSTAT,4)
// CMOUT<MC1OUT>
extern volatile __bit                   MC1OUT              __at(0x378);	// @ (0x6F * 8 + 0)
#define                                 MC1OUT_bit          _BIT_ACCESS(CMOUT,0)
// CMOUT<MC2OUT>
extern volatile __bit                   MC2OUT              __at(0x379);	// @ (0x6F * 8 + 1)
#define                                 MC2OUT_bit          _BIT_ACCESS(CMOUT,1)
// ADCON2<MD0>
extern volatile __bit                   MD0                 __at(0x1FA8);	// @ (0x3F5 * 8 + 0)
#define                                 MD0_bit             _BIT_ACCESS(ADCON2,0)
// ADCON2<MD1>
extern volatile __bit                   MD1                 __at(0x1FA9);	// @ (0x3F5 * 8 + 1)
#define                                 MD1_bit             _BIT_ACCESS(ADCON2,1)
// T0CON0<MD16>
extern volatile __bit                   MD16                __at(0x18D4);	// @ (0x31A * 8 + 4)
#define                                 MD16_bit            _BIT_ACCESS(T0CON0,4)
// MD1CON0<MD1BIT>
extern volatile __bit                   MD1BIT              __at(0x350);	// @ (0x6A * 8 + 0)
#define                                 MD1BIT_bit          _BIT_ACCESS(MD1CON0,0)
// MD1CARH<MD1CH0>
extern volatile __bit                   MD1CH0              __at(0x370);	// @ (0x6E * 8 + 0)
#define                                 MD1CH0_bit          _BIT_ACCESS(MD1CARH,0)
// MD1CARH<MD1CH1>
extern volatile __bit                   MD1CH1              __at(0x371);	// @ (0x6E * 8 + 1)
#define                                 MD1CH1_bit          _BIT_ACCESS(MD1CARH,1)
// MD1CARH<MD1CH2>
extern volatile __bit                   MD1CH2              __at(0x372);	// @ (0x6E * 8 + 2)
#define                                 MD1CH2_bit          _BIT_ACCESS(MD1CARH,2)
// MD1CARH<MD1CH3>
extern volatile __bit                   MD1CH3              __at(0x373);	// @ (0x6E * 8 + 3)
#define                                 MD1CH3_bit          _BIT_ACCESS(MD1CARH,3)
// MD1CARH<MD1CH4>
extern volatile __bit                   MD1CH4              __at(0x374);	// @ (0x6E * 8 + 4)
#define                                 MD1CH4_bit          _BIT_ACCESS(MD1CARH,4)
// MD1CARH<MD1CH5>
extern volatile __bit                   MD1CH5              __at(0x375);	// @ (0x6E * 8 + 5)
#define                                 MD1CH5_bit          _BIT_ACCESS(MD1CARH,5)
// MD1CARH<MD1CH6>
extern volatile __bit                   MD1CH6              __at(0x376);	// @ (0x6E * 8 + 6)
#define                                 MD1CH6_bit          _BIT_ACCESS(MD1CARH,6)
// MD1CARH<MD1CH7>
extern volatile __bit                   MD1CH7              __at(0x377);	// @ (0x6E * 8 + 7)
#define                                 MD1CH7_bit          _BIT_ACCESS(MD1CARH,7)
// MD1CON1<MD1CHPOL>
extern volatile __bit                   MD1CHPOL            __at(0x35D);	// @ (0x6B * 8 + 5)
#define                                 MD1CHPOL_bit        _BIT_ACCESS(MD1CON1,5)
// MD1CON1<MD1CHSYNC>
extern volatile __bit                   MD1CHSYNC           __at(0x35C);	// @ (0x6B * 8 + 4)
#define                                 MD1CHSYNC_bit       _BIT_ACCESS(MD1CON1,4)
// MD1CARL<MD1CL0>
extern volatile __bit                   MD1CL0              __at(0x368);	// @ (0x6D * 8 + 0)
#define                                 MD1CL0_bit          _BIT_ACCESS(MD1CARL,0)
// MD1CARL<MD1CL1>
extern volatile __bit                   MD1CL1              __at(0x369);	// @ (0x6D * 8 + 1)
#define                                 MD1CL1_bit          _BIT_ACCESS(MD1CARL,1)
// MD1CARL<MD1CL2>
extern volatile __bit                   MD1CL2              __at(0x36A);	// @ (0x6D * 8 + 2)
#define                                 MD1CL2_bit          _BIT_ACCESS(MD1CARL,2)
// MD1CARL<MD1CL3>
extern volatile __bit                   MD1CL3              __at(0x36B);	// @ (0x6D * 8 + 3)
#define                                 MD1CL3_bit          _BIT_ACCESS(MD1CARL,3)
// MD1CARL<MD1CL4>
extern volatile __bit                   MD1CL4              __at(0x36C);	// @ (0x6D * 8 + 4)
#define                                 MD1CL4_bit          _BIT_ACCESS(MD1CARL,4)
// MD1CON1<MD1CLPOL>
extern volatile __bit                   MD1CLPOL            __at(0x359);	// @ (0x6B * 8 + 1)
#define                                 MD1CLPOL_bit        _BIT_ACCESS(MD1CON1,1)
// MD1CON1<MD1CLSYNC>
extern volatile __bit                   MD1CLSYNC           __at(0x358);	// @ (0x6B * 8 + 0)
#define                                 MD1CLSYNC_bit       _BIT_ACCESS(MD1CON1,0)
// MD1CON0<MD1EN>
extern volatile __bit                   MD1EN               __at(0x357);	// @ (0x6A * 8 + 7)
#define                                 MD1EN_bit           _BIT_ACCESS(MD1CON0,7)
// MD1SRC<MD1MS0>
extern volatile __bit                   MD1MS0              __at(0x360);	// @ (0x6C * 8 + 0)
#define                                 MD1MS0_bit          _BIT_ACCESS(MD1SRC,0)
// MD1SRC<MD1MS1>
extern volatile __bit                   MD1MS1              __at(0x361);	// @ (0x6C * 8 + 1)
#define                                 MD1MS1_bit          _BIT_ACCESS(MD1SRC,1)
// MD1SRC<MD1MS2>
extern volatile __bit                   MD1MS2              __at(0x362);	// @ (0x6C * 8 + 2)
#define                                 MD1MS2_bit          _BIT_ACCESS(MD1SRC,2)
// MD1SRC<MD1MS3>
extern volatile __bit                   MD1MS3              __at(0x363);	// @ (0x6C * 8 + 3)
#define                                 MD1MS3_bit          _BIT_ACCESS(MD1SRC,3)
// MD1SRC<MD1MS4>
extern volatile __bit                   MD1MS4              __at(0x364);	// @ (0x6C * 8 + 4)
#define                                 MD1MS4_bit          _BIT_ACCESS(MD1SRC,4)
// MD1SRC<MD1MS5>
extern volatile __bit                   MD1MS5              __at(0x365);	// @ (0x6C * 8 + 5)
#define                                 MD1MS5_bit          _BIT_ACCESS(MD1SRC,5)
// MD1CON0<MD1OPOL>
extern volatile __bit                   MD1OPOL             __at(0x354);	// @ (0x6A * 8 + 4)
#define                                 MD1OPOL_bit         _BIT_ACCESS(MD1CON0,4)
// MD1CON0<MD1OUT>
extern volatile __bit                   MD1OUT              __at(0x355);	// @ (0x6A * 8 + 5)
#define                                 MD1OUT_bit          _BIT_ACCESS(MD1CON0,5)
// ADCON2<MD2>
extern volatile __bit                   MD2                 __at(0x1FAA);	// @ (0x3F5 * 8 + 2)
#define                                 MD2_bit             _BIT_ACCESS(ADCON2,2)
// MD1CARHPPS<MDCARHPPS0>
extern volatile __bit                   MDCARHPPS0          __at(0x12F8);	// @ (0x25F * 8 + 0)
#define                                 MDCARHPPS0_bit      _BIT_ACCESS(MD1CARHPPS,0)
// MD1CARHPPS<MDCARHPPS1>
extern volatile __bit                   MDCARHPPS1          __at(0x12F9);	// @ (0x25F * 8 + 1)
#define                                 MDCARHPPS1_bit      _BIT_ACCESS(MD1CARHPPS,1)
// MD1CARHPPS<MDCARHPPS2>
extern volatile __bit                   MDCARHPPS2          __at(0x12FA);	// @ (0x25F * 8 + 2)
#define                                 MDCARHPPS2_bit      _BIT_ACCESS(MD1CARHPPS,2)
// MD1CARHPPS<MDCARHPPS3>
extern volatile __bit                   MDCARHPPS3          __at(0x12FB);	// @ (0x25F * 8 + 3)
#define                                 MDCARHPPS3_bit      _BIT_ACCESS(MD1CARHPPS,3)
// MD1CARHPPS<MDCARHPPS4>
extern volatile __bit                   MDCARHPPS4          __at(0x12FC);	// @ (0x25F * 8 + 4)
#define                                 MDCARHPPS4_bit      _BIT_ACCESS(MD1CARHPPS,4)
// MD1CARLPPS<MDCARLPPS0>
extern volatile __bit                   MDCARLPPS0          __at(0x12F0);	// @ (0x25E * 8 + 0)
#define                                 MDCARLPPS0_bit      _BIT_ACCESS(MD1CARLPPS,0)
// MD1CARLPPS<MDCARLPPS1>
extern volatile __bit                   MDCARLPPS1          __at(0x12F1);	// @ (0x25E * 8 + 1)
#define                                 MDCARLPPS1_bit      _BIT_ACCESS(MD1CARLPPS,1)
// MD1CARLPPS<MDCARLPPS2>
extern volatile __bit                   MDCARLPPS2          __at(0x12F2);	// @ (0x25E * 8 + 2)
#define                                 MDCARLPPS2_bit      _BIT_ACCESS(MD1CARLPPS,2)
// MD1CARLPPS<MDCARLPPS3>
extern volatile __bit                   MDCARLPPS3          __at(0x12F3);	// @ (0x25E * 8 + 3)
#define                                 MDCARLPPS3_bit      _BIT_ACCESS(MD1CARLPPS,3)
// MD1CARLPPS<MDCARLPPS4>
extern volatile __bit                   MDCARLPPS4          __at(0x12F4);	// @ (0x25E * 8 + 4)
#define                                 MDCARLPPS4_bit      _BIT_ACCESS(MD1CARLPPS,4)
// I2C1CON0<MDR>
extern volatile __bit                   MDR                 __at(0x14A3);	// @ (0x294 * 8 + 3)
#define                                 MDR_bit             _BIT_ACCESS(I2C1CON0,3)
// MD1SRCPPS<MDSRCPPS0>
extern volatile __bit                   MDSRCPPS0           __at(0x1300);	// @ (0x260 * 8 + 0)
#define                                 MDSRCPPS0_bit       _BIT_ACCESS(MD1SRCPPS,0)
// MD1SRCPPS<MDSRCPPS1>
extern volatile __bit                   MDSRCPPS1           __at(0x1301);	// @ (0x260 * 8 + 1)
#define                                 MDSRCPPS1_bit       _BIT_ACCESS(MD1SRCPPS,1)
// MD1SRCPPS<MDSRCPPS2>
extern volatile __bit                   MDSRCPPS2           __at(0x1302);	// @ (0x260 * 8 + 2)
#define                                 MDSRCPPS2_bit       _BIT_ACCESS(MD1SRCPPS,2)
// MD1SRCPPS<MDSRCPPS3>
extern volatile __bit                   MDSRCPPS3           __at(0x1303);	// @ (0x260 * 8 + 3)
#define                                 MDSRCPPS3_bit       _BIT_ACCESS(MD1SRCPPS,3)
// MD1SRCPPS<MDSRCPPS4>
extern volatile __bit                   MDSRCPPS4           __at(0x1304);	// @ (0x260 * 8 + 4)
#define                                 MDSRCPPS4_bit       _BIT_ACCESS(MD1SRCPPS,4)
// PCON1<MEMV>
extern volatile __bit                   MEMV                __at(0x2789);	// @ (0x4F1 * 8 + 1)
#define                                 MEMV_bit            _BIT_ACCESS(PCON1,1)
// OSCEN<MFOEN>
extern volatile __bit                   MFOEN               __at(0x59D);	// @ (0xB3 * 8 + 5)
#define                                 MFOEN_bit           _BIT_ACCESS(OSCEN,5)
// OSCSTAT<MFOR>
extern volatile __bit                   MFOR                __at(0x595);	// @ (0xB2 * 8 + 5)
#define                                 MFOR_bit            _BIT_ACCESS(OSCSTAT,5)
// I2C1STAT0<MMA>
extern volatile __bit                   MMA                 __at(0x14C5);	// @ (0x298 * 8 + 5)
#define                                 MMA_bit             _BIT_ACCESS(I2C1STAT0,5)
// PWMEN<MPWM1EN>
extern volatile __bit                   MPWM1EN             __at(0x24E8);	// @ (0x49D * 8 + 0)
#define                                 MPWM1EN_bit         _BIT_ACCESS(PWMEN,0)
// PWMLOAD<MPWM1LD>
extern volatile __bit                   MPWM1LD             __at(0x24E0);	// @ (0x49C * 8 + 0)
#define                                 MPWM1LD_bit         _BIT_ACCESS(PWMLOAD,0)
// PWMEN<MPWM2EN>
extern volatile __bit                   MPWM2EN             __at(0x24E9);	// @ (0x49D * 8 + 1)
#define                                 MPWM2EN_bit         _BIT_ACCESS(PWMEN,1)
// PWMLOAD<MPWM2LD>
extern volatile __bit                   MPWM2LD             __at(0x24E1);	// @ (0x49C * 8 + 1)
#define                                 MPWM2LD_bit         _BIT_ACCESS(PWMLOAD,1)
// PWMEN<MPWM3EN>
extern volatile __bit                   MPWM3EN             __at(0x24EA);	// @ (0x49D * 8 + 2)
#define                                 MPWM3EN_bit         _BIT_ACCESS(PWMEN,2)
// PWMLOAD<MPWM3LD>
extern volatile __bit                   MPWM3LD             __at(0x24E2);	// @ (0x49C * 8 + 2)
#define                                 MPWM3LD_bit         _BIT_ACCESS(PWMLOAD,2)
// SCANCON0<MREG>
extern volatile __bit                   MREG                __at(0x1B02);	// @ (0x360 * 8 + 2)
#define                                 MREG_bit            _BIT_ACCESS(SCANCON0,2)
// MD1SRC<MS0>
extern volatile __bit                   MS0                 __at(0x360);	// @ (0x6C * 8 + 0)
#define                                 MS0_bit             _BIT_ACCESS(MD1SRC,0)
// MD1SRC<MS1>
